senserf/picos/PicOS/MSP430/main.c
#include "kernel.h"
#include "storage.h"

/* ==================================================================== */
/* Copyright (C) Olsonet Communications, 2002 - 2010                    */
/* All rights reserved.                                                 */
/* ==================================================================== */

#include "irq_timer_headers.h"

extern 			pcb_t		*zz_curr;
extern 			address	zz_utims [MAX_UTIMERS];
extern	void		_reset_vector__;

void	zz_malloc_init (void);

/* ========================== */
/* Device driver initializers */
/* ========================== */

#if	UART_DRIVER || UART_TCV

static void preinit_uart (void);

#if	UART_DRIVER

#define	N_UARTS	UART_DRIVER

static void	devinit_uart (int);

#else	/* UART_DRIVER */

#define	N_UARTS	UART_TCV

#endif	/* UART_DRIVER */

// ============================================================================
// This is clumsy. We need a way to make the second UART configurable
// dynamically, as it can be shared with SPI, so we need it as a formal
// device, but we don't want the preinit, freeze auto enable/disable, etc.
// ============================================================================

#if N_UARTS < 2
// This is defined in mach.h, but can be undef'ed, e.g., from options.sys
#ifdef	UART_PREINIT_B
#undef	UART_PREINIT_B
#endif
#endif

// ============================================================================

#endif  /* UART_DRIVER || UART_TCV */

extern void	__bss_end;

#if MAX_DEVICES

// As it happens, on MSP430, UART is the only "device" (a good reason to get
// rid of the concept)

const static devinit_t devinit [MAX_DEVICES] = {
/* === */
#if	UART_DRIVER
		{ devinit_uart,	 0 },
#else
		{ NULL, 0 },
#endif
/* === */
#if	MAX_DEVICES > 1
#if	UART_DRIVER > 1
		{ devinit_uart,	 1 },
#else
		{ NULL, 0 }
#endif
#endif	/* MAX_DEVICES > 1 */
	 };

#endif	/* MAX_DEVICES */

static void ssm_init (void), mem_init (void), ios_init (void);

void reset (void) {

	cli_tim;

// EEPROM/SD panic ============================================================

#ifdef	EEPROM_PRESENT
	ee_panic ();
#endif
#ifdef	SDCARD_PRESENT
	sd_panic ();
#endif

// ============================================================================

	while (1) 
		hard_reset;
}

void halt (void) {

	cli_tim;
	diag ("PicOS halted");
	mdelay (500);
	while (1)
		_BIS_SR (LPM4_bits);
}

#if	ADC_PRESENT
#error "S: ADC_PRESENT on MSP430 is illegal"
// There is no general ADC interface at the moment. Well, not of the same
// kind as there used to be for eCOG. There is an ADC sampler (see
// ../adc_sampler.[ch]) as well as various board-specific hooks to the ADC.
// Also, the ADC is used internally for Radio RSSI.
#endif

int main (void) {

#if	STACK_GUARD
	{ register word i;
	for (i = 0; i < (STACK_SIZE / sizeof (word)); i++)
		// This leaves out one word at the very bottom, but that's
		// fine
		*((((address)STACK_END) - 1) + i) = STACK_SENTINEL;
	}
#endif
	/* Initialization */
	ssm_init ();
	// mdelay (1);
	mem_init ();
	// mdelay (1);
	ios_init ();

#if	TCV_PRESENT
	tcv_init ();
#endif
	// Assume root process identity
	zz_curr = (pcb_t*) fork (root, NULL);
	// Delay root startup for 16 msec to give the drivers a chance to
	// go first, regardless where they are
	delay (16, 0);

	powerup ();

#if TRIPLE_CLOCK == 0
	// Start the clock; no need to do that in TRIPLE_CLOCK mode where the
	// clock is started explicitly by delay requests
	sti_tim;
#endif
	_EINT ();

	// Fall through to scheduler

#include "scheduler.h"

}

#if DIAG_MESSAGES > 1
void zzz_syserror (int ec, const char *m) {

	WATCHDOG_STOP;

#if	DUMP_MEMORY
	dmp_mem ();
#endif
	diag ("SYSERR: %x, %s", ec, m);
#else
void zzz_syserror (int ec) {

	WATCHDOG_STOP;

	dbg_0 (ec); // SYSTEM ERROR
	diag ("SYSERR: %x", ec);
#endif
	cli;

#if RESET_ON_SYSERR

#if LEDS_DRIVER
	for (zz_mintk = 0; zz_mintk < 32; zz_mintk++)
		all_leds_blink;
#endif
	reset ();

#else	/* RESET_ON_SYSERR */

// ========== DISABLED ========================================================
#if 0
#ifdef	EEPROM_PRESENT
	ee_sync (WNONE);
#endif
#ifdef	SDRAM_PRESENT
	sd_sync ();
#endif
#endif
// ============================================================================

	while (1) {
#if LEDS_DRIVER
		all_leds_blink;
#else
		_BIS_SR (LPM4_bits);
#endif
	}
#endif	/* RESET_ON_SYSERR */
}

// ============================================================================
// ssm_init ===================================================================
// ============================================================================

#ifdef	PIN_PORTMAP

static const portmap_t portmap [] = PIN_PORTMAP;

#define	n_portmap (sizeof (portmap) / sizeof (portmap_t))

#endif

// ============================================================================

static void ssm_init () {

	// Disable watchdog timer
	WATCHDOG_STOP;

#include "portinit.h"

// ======================
// Monitor pins overrides
// ======================
#ifdef	MONITOR_PIN_CPU
	_PDS (MONITOR_PIN_CPU, 1);
#endif
#ifdef	MONITOR_PIN_CLOCK
	_PDS (MONITOR_PIN_CLOCK, 1);
#endif
#ifdef	MONITOR_PIN_CLOCKA
	_PDS (MONITOR_PIN_CLOCKA, 1);
#endif
#ifdef	MONITOR_PIN_CLOCKS
	_PDS (MONITOR_PIN_CLOCKS, 1);
#endif
#ifdef	MONITOR_PIN_SCHED
	_PDS (MONITOR_PIN_SCHED, 1);
#endif

// ===========================================================================
// Clock setup ===============================================================
// ===========================================================================

#ifndef	MCLOCK_FROM_CRYSTAL
#define	MCLOCK_FROM_CRYSTAL	0
#endif

#ifdef	__MSP430_1xx__

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL == 0

	// DCO: select maximum frequency
	DCOCTL = DCO2 + DCO1 + DCO0;
	BCSCTL1 = RSEL2 + RSEL1 + RSEL0 + XT2OFF

#if	CRYSTAL_RATE != 32768
	// We are using a high-speed crystal for XT1
		+ XTS
#endif
	;
	// Measured MCLK is ca. 4.5 MHz

// This is in kHz
#define	CPU_CLOCK_RATE	4500

#if 	CRYSTAL2_RATE
	// Assign SMCLK to XTL2
	BCSCTL2 = SELM_DCOCLK | SELS;
#endif

